hpmicro/hpm_sdk/soc/HPM6P00/ip/hpm_ppi_regs.h
/* CS register group index macro definition */
#define PPI_CS_0 (0UL)
#define PPI_CS_1 (1UL)
#define PPI_CS_2 (2UL)
#define PPI_CS_3 (3UL)

/* CMD register group index macro definition */
#define PPI_CMD_0 (0UL)
#define PPI_CMD_1 (1UL)
#define PPI_CMD_2 (2UL)
#define PPI_CMD_3 (3UL)
#define PPI_CMD_4 (4UL)
#define PPI_CMD_5 (5UL)
#define PPI_CMD_6 (6UL)
#define PPI_CMD_7 (7UL)
#define PPI_CMD_8 (8UL)
#define PPI_CMD_9 (9UL)
#define PPI_CMD_10 (10UL)
#define PPI_CMD_11 (11UL)
#define PPI_CMD_12 (12UL)
#define PPI_CMD_13 (13UL)
#define PPI_CMD_14 (14UL)
#define PPI_CMD_15 (15UL)
#define PPI_CMD_16 (16UL)
#define PPI_CMD_17 (17UL)
#define PPI_CMD_18 (18UL)
#define PPI_CMD_19 (19UL)
#define PPI_CMD_20 (20UL)
#define PPI_CMD_21 (21UL)
#define PPI_CMD_22 (22UL)
#define PPI_CMD_23 (23UL)
#define PPI_CMD_24 (24UL)
#define PPI_CMD_25 (25UL)
#define PPI_CMD_26 (26UL)
#define PPI_CMD_27 (27UL)
#define PPI_CMD_28 (28UL)
#define PPI_CMD_29 (29UL)
#define PPI_CMD_30 (30UL)
#define PPI_CMD_31 (31UL)
#define PPI_CMD_32 (32UL)
#define PPI_CMD_33 (33UL)
#define PPI_CMD_34 (34UL)
#define PPI_CMD_35 (35UL)
#define PPI_CMD_36 (36UL)
#define PPI_CMD_37 (37UL)
#define PPI_CMD_38 (38UL)
#define PPI_CMD_39 (39UL)
#define PPI_CMD_40 (40UL)
#define PPI_CMD_41 (41UL)
#define PPI_CMD_42 (42UL)
#define PPI_CMD_43 (43UL)
#define PPI_CMD_44 (44UL)
#define PPI_CMD_45 (45UL)
#define PPI_CMD_46 (46UL)
#define PPI_CMD_47 (47UL)
#define PPI_CMD_48 (48UL)
#define PPI_CMD_49 (49UL)
#define PPI_CMD_50 (50UL)
#define PPI_CMD_51 (51UL)
#define PPI_CMD_52 (52UL)
#define PPI_CMD_53 (53UL)
#define PPI_CMD_54 (54UL)
#define PPI_CMD_55 (55UL)
#define PPI_CMD_56 (56UL)
#define PPI_CMD_57 (57UL)
#define PPI_CMD_58 (58UL)
#define PPI_CMD_59 (59UL)
#define PPI_CMD_61 (61UL)
#define PPI_CMD_62 (62UL)
#define PPI_CMD_63 (63UL)


#endif /* HPM_PPI_H */
